app/Controllers/Backend/Faq.php

INSERT INTO `tbl_faq` (`question`, `answer`) VALUES ('Test', 'A asdasd')
---
    public function create()
    {
        $post = $this->request->getPost(['question', 'answer']);
        $faqModel = new FaqModel;

        $rules = [
            'question' => 'required',
            'answer' => 'required',
        ];

        if(!$this->validate($rules)) {
            $json = [
                'error' => true,
                'question' => $this->validator->showError('question', 'errorSingle'),
                'answer' => $this->validator->showError('answer', 'errorSingle'),
            ];

            echo json_encode($json);
            exit();
        }

        $data['question'] = $post['question'];
        $data['answer'] = $post['answer'];

        $faqModel->insert($data);