app/Controllers/Order.php

    public function package($packageId = NULL)
    {
        if(!$packageId) {
            return redirect()->to(site_url());
        }

        $packageModel = new PackageModel;
        $addonModel = new AddonModel;
        $channelModel = new ChannelModel;

        $packageId = decrypt($packageId);
        $package = $packageModel->find($packageId);

        if(!$package) {
            return redirect()->to(site_url());
        }

        $data['page'] = "order/view";
        $data['data'] = $package;
        $data['addon'] = $addonModel->where(['addon_status' => 1, 'addon_type' => $package->package_type])->findAll();
        $data['desc'] = explode(',', $package->package_desc);
        $data['method'] = $this->enum->paymentMethod();
        $data['duration'] = $this->enum->packageDuration();
        $data['channel'] = $channelModel->where('channel_status', 1)->findAll();
---
SELECT *
FROM `tbl_package`
WHERE `tbl_package`.`package_id` = '4'
SELECT *
FROM `tbl_addon`
WHERE `addon_status` = 1
AND `addon_type` = 'company'
SELECT *
FROM `tbl_channel`
WHERE `channel_status` = 1

    public function getChannel()
    {
        $post = $this->request->getPost(['payMethod']);

        if(!isset($post['payMethod'])) {
            echo json_encode(['error' => true]);
        }

        $channelModel = new ChannelModel;
        $paymentMethod = decrypt($post['payMethod']);
        $channel = $channelModel->where('channel_category', $paymentMethod)->findAll();
---
SELECT *
FROM `tbl_channel`
WHERE `channel_category` = 'credit_card'

    private function getPaymentFee($channelId = NULL, $subtotal = NULL)
    {
        $channelModel = new ChannelModel;
        $data = $channelModel->find($channelId);
---
SELECT *
FROM `tbl_channel`
WHERE `tbl_channel`.`channel_id` = '3'