app/Controllers/Pricing.php

SELECT *
FROM `tbl_feature`
WHERE `feature_status` = 1
SELECT *
FROM `tbl_package`
WHERE `package_status` = 1
AND `package_type` = 'personal'
SELECT *
FROM `tbl_addon`
WHERE `addon_status` = 1
AND `addon_type` = 'personal'
---
    public function index(): string
    {
        $featureModel = new FeatureModel;
        $packageModel = new PackageModel;
        $addonModel = new AddonModel;

        $data['page'] = "pricing/view";
        $data['feature'] = $featureModel->where('feature_status', 1)->findAll();
        $data['price'] = [];

        $packageType = $this->enum->packageType();

        foreach ($packageType as $key => $value) {
            $data['price'][$key] = [
                'price' => ['key' => $key, 'value' => $value],
                'package' => $packageModel->where(['package_status' => 1, 'package_type' => $key])->findAll(),
                'addon' => $addonModel->where(['addon_status' => 1, 'addon_type' => $key])->findAll(),